In [1]:
import pandas as pd 
italy_weather = pd.DataFrame({"city" : ["Rome","Napoli","Milan" ],
                               "Temperature" : [32,24,45],
                               "Humidity": [80,60,70] })

C:\Users\DELL\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [2]:
us_weather = pd.DataFrame({"city" : ["new york","paris","egypt" ],
                               "Temperature" : [37,44,35],
                               "Humidity": [45,84,76]})

In [3]:
df = pd.concat([italy_weather,us_weather])
df

       city  Temperature  Humidity
0      Rome           32        80
1    Napoli           24        60
2     Milan           45        70
0  new york           37        45
1     paris           44        84
2     egypt           35        76

In [4]:
df = pd.concat([italy_weather,us_weather],ignore_index=True)
df

       city  Temperature  Humidity
0      Rome           32        80
1    Napoli           24        60
2     Milan           45        70
3  new york           37        45
4     paris           44        84
5     egypt           35        76

In [5]:
df.to_csv("concatinatedDFs.csv" , index=False)

In [8]:
df = pd.concat([italy_weather,us_weather], keys=["italy","us"] )
df

             city  Temperature  Humidity
italy 0      Rome           32        80
      1    Napoli           24        60
      2     Milan           45        70
us    0  new york           37        45
      1     paris           44        84
      2     egypt           35        76

In [9]:
df.loc["us"]

       city  Temperature  Humidity
0  new york           37        45
1     paris           44        84
2     egypt           35        76

In [10]:
df.loc["italy"]

     city  Temperature  Humidity
0    Rome           32        80
1  Napoli           24        60
2   Milan           45        70

In [11]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[4,5,2])
temperature_df

       city  temperature
4    mumbai           32
5     delhi           45
2  banglore           30

In [12]:
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi          7
0  mumbai         12

In [14]:
df=pd.concat([temperature_df,windspeed_df])
df

       city  temperature  windspeed
4    mumbai         32.0        NaN
5     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0

In [17]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

       city  temperature    city  windspeed
4    mumbai         32.0     NaN        NaN
5     delhi         45.0     NaN        NaN
2  banglore         30.0     NaN        NaN
1       NaN          NaN   delhi        7.0
0       NaN          NaN  mumbai       12.0